In [2]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [3]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)), 
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)), 
                   columns=list('abcde'))

print(df1)
print(df2)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0
      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [5]:
df2.loc[1, 'b'] = np.nan 
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [6]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [7]:
df1.add(df2, fill_value=0) #soma os valores sem deixar valores null

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [8]:
#comados equivalentes
print(1/df1)
print(df1.rdiv(1))

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909
       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [13]:
df1.reindex(columns=df2.columns, fill_value='X')

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  X
1  4.0  5.0   6.0   7.0  X
2  8.0  9.0  10.0  11.0  X